[
    {
        "time": "Jun 2019 - Present",
        "location": "Dr. Benyuan Liu, MIT",
        "link": "https://www.cs.uml.edu/~bliu/index.html",
        "position": "Computer Science Research Internship",
        "details": [
            "Working with Dr. Liu's group to automatically diagnose Retinopathy of Prematurity (potentially blinding disease common to premature infants) using deep learning",
            "Classifying disease stage by combining object detection and convolutional neural networks",
            "Proposing a novel method by first highlighting the symptomatic ridges using object detection before feeding the highlighted image into a classifier"
        ],
        "publication_name": "A. Ding, Q. Chen, Y. Cao and B. Liu, \"Retinopathy of Prematurity Stage Diagnosis Using Object Segmentationand Convolutional Neural Networks,\" 2020 International Joint Conference on Neural Networks (IJCNN), in press",
        "publication_type": "Publication"
    },
    {
        "time": "April 2019 - Present",
        "location": "MIT PRIMES",
        "link": "http://math.mit.edu/research/highschool/primes/index.php",
        "position": "Rigorous Research Program",
        "publication_name": "An Evaluation of UPC++ by Porting Shared-Memory Parallel Graph Algorithms",
        "publication_link": "http://math.mit.edu/research/highschool/primes/materials/2019/Ding.pdf",
        "publication_type": "Technical Report", 
        "details": [
            "Evaluating the convenience, scalability, and robustness of UPC++, a parallel distributed partitioned global address space library, by testing common parallel graph algorithms implemented using library and OpenMP, a common shared-memory parallel library",
            "Ran experiments on AWS Clusters and Multi-Processor machines",
            "Presenting at MIT for the PRIMES conference"
        ]
    },
    {
        "time": "Jul 2018 - Aug 2018",
        "location": "CogWorks, Beaverworks Summer Institute",
        "link": "https://beaverworks.ll.mit.edu/CMS/bw/bwsi",
        "position": "Summer Workshop",
        "details": [
            "Worked with my team to create Amazon Alexa plugins that support music, user identity, and mood (by voice/image) mood recognition, as well as a home-made Google image search functionality, using convolutional neural networks and NLP",
            "Trained an undefeated Connect-4 AI based on the AlphaGo paper",
            "Created a program to track finger movement with a camera to process handwriting input"
        ],
        "github_link": "https://https://github.com/alexding123/BWSI-Final",
        "video_link": "MBgzzXL_GCM"
    },
    {
        "time": "Jul 2017 - Aug 2017",
        "location": "NuVu Studio",
        "link": "https://cambridge.nuvustudio.com/",
        "position": "Summer Workshop",
        "details": [
            "Created a mobile AR Nutrition Scanner displaying human-readable nutrition facts using 3D animations using Unity"
        ],
        "github_link": "https://github.com/alexding123/AR-Nutrition-Scanner",
        "video_link": "m7DIHmdrfaw"
    }
]